salara1960/stm32f411/Src/main.c
void *getMem(size_t len)
{
#ifdef SET_CALLOC_MEM
		return (calloc(1, len));
#else
	#ifdef SET_MALLOC_MEM
		return (malloc(len));
	#else
		return (pvPortMalloc(len));
	#endif
#endif
}
//------------------------------------------------------------------------------------
void freeMem(void *mem)
{
#if defined(SET_CALLOC_MEM) || defined(SET_MALLOC_MEM)
		free(mem);
#else
		vPortFree(mem);
#endif
}

#endif
//------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------
char *printOut(char *tmp)
{

switch (outMode) {
	case jfesMode:
	{
		jfes_value_t *obj = jfes_create_object_value(jconf);
		if (obj) {
			char dt[32] = {0};
			sec_to_str_time(dt);
			jfes_set_object_property(jconf, obj, jfes_create_string_value(jconf, dt, 0), "time", 0);
			jfes_set_object_property(jconf, obj, jfes_create_integer_value(jconf, tik), "ms", 0);
			jfes_value_t *arr1 = jfes_create_array_value(jconf);
			if (arr1) {
				jfes_place_to_array(jconf, arr1, jfes_create_integer_value(jconf, cnt_evt));
				jfes_place_to_array(jconf, arr1, jfes_create_integer_value(jconf, max_evt));
				jfes_set_object_property(jconf, obj, arr1, "fifo", 0);
			}
			if (devError) jfes_set_object_property(jconf, obj, jfes_create_integer_value(jconf, devError), "devError", 0);
			jfes_set_object_property(jconf, obj, jfes_create_double_value(jconf, VccF), "volt", 0);
			//
#ifdef SET_BMx280
			jfes_value_t *sens1 = jfes_create_object_value(jconf);
			if (sens1) {
				jfes_set_object_property(jconf, sens1, jfes_create_double_value(jconf, sensors.bmx_pres), "press", 0);
				jfes_set_object_property(jconf, sens1, jfes_create_double_value(jconf, sensors.bmx_temp), "temp", 0);
				if (reg_id == BME280_SENSOR)
					jfes_set_object_property(jconf, sens1, jfes_create_double_value(jconf, sensors.bmx_humi), "humi", 0);
				jfes_set_object_property(jconf, obj, sens1, bmxName, 0);//"sensName"
			} else devError |= devMem;
#endif
			//
			jfes_value_t *sens2 = jfes_create_object_value(jconf);
			if (sens2) {
				jfes_set_object_property(jconf, sens2, jfes_create_double_value(jconf, compData.angleHMC), "azimut", 0);
				jfes_set_object_property(jconf, sens2, jfes_create_double_value(jconf, compData.tempHMC), "temp2", 0);
				jfes_set_object_property(jconf, obj, sens2, "QMC5883L", 0);//"sensName"
			} else devError |= devMem;
			//
			jfes_value_t *sens3 = jfes_create_object_value(jconf);
			if (sens3) {
				jfes_set_object_property(jconf, sens3, jfes_create_integer_value(jconf, mpuStatus), "stat", 0);
				jfes_set_object_property(jconf, sens3, jfes_create_double_value(jconf, mpu_data.TEMP), "temp3", 0);
				jfes_value_t *arr2 = jfes_create_array_value(jconf);
				if (arr2) {
					jfes_place_to_array(jconf, arr2, jfes_create_double_value(jconf, mpu_data.xACCEL));
					jfes_place_to_array(jconf, arr2, jfes_create_double_value(jconf, mpu_data.yACCEL));
					jfes_place_to_array(jconf, arr2, jfes_create_double_value(jconf, mpu_data.zACCEL));
					jfes_set_object_property(jconf, sens3, arr2, "accel", 0);
				}
				jfes_value_t *arr3 = jfes_create_array_value(jconf);
				if (arr3) {
					jfes_place_to_array(jconf, arr3, jfes_create_double_value(jconf, mpu_data.xGYRO));
					jfes_place_to_array(jconf, arr3, jfes_create_double_value(jconf, mpu_data.yGYRO));
					jfes_place_to_array(jconf, arr3, jfes_create_double_value(jconf, mpu_data.zGYRO));
					jfes_set_object_property(jconf, sens3, arr3, "gyro", 0);
				}
				jfes_set_object_property(jconf, obj, sens3, "MPU6050", 0);//"sensName"
			} else devError |= devMem;
			//
			jfes_size_t ssize  = (jfes_size_t)((MAX_TMP_SIZE << 1) - 1);
			jfes_value_to_string(obj, tmp, &ssize, jtune);
			*(tmp + ssize) = '\0';
			strcat(tmp, ">");

			jfes_free_value(jconf, obj);
		} else devError |= devMem;
	}
	break;
	case jsonMode:
	{
		char dt[32] = {0};
		sec_to_str_time(dt);
		sprintf(tmp, "%s{%s  \"time\": \"%s\",%s  \"ms\": %lu,%s  \"fifo\": [%u,%u]",
					cr_lf, cr_lf, dt, cr_lf, tik, cr_lf, cnt_evt, max_evt);
		if (devError) sprintf(tmp+strlen(tmp), ",%s  \"devError\": 0x%02X", cr_lf, devError);
		sprintf(tmp+strlen(tmp), ",%s  \"volt\": %.3f", cr_lf, VccF);
#ifdef SET_BMx280
		sprintf(tmp+strlen(tmp), ",%s  \"%s\": {%s    \"press\": %.2f,%s    \"temp\": %.2f",
					cr_lf, bmxName, cr_lf, sensors.bmx_pres, cr_lf, sensors.bmx_temp);
		if (reg_id == BME280_SENSOR) sprintf(tmp+strlen(tmp), ",%s    \"humi\": %.2f", cr_lf, sensors.bmx_humi);
		sprintf(tmp+strlen(tmp), "%s  }", cr_lf);
#endif
		sprintf(tmp+strlen(tmp), ",%s  \"QMC5883L\": {%s    \"azimut\": %.2f,%s    \"temp2\": %.2f%s  }" ,
					cr_lf, cr_lf, compData.angleHMC, cr_lf, compData.tempHMC, cr_lf);
#ifdef SET_MPU
		sprintf(tmp+strlen(tmp), ",%s  \"MPU6050\": {%s    \"stat\": %X,%s    \"temp3\": %.2f,%s    \"accel\": [%.2f,%.2f,%.2f],%s    \"gyro\": [%.2f,%.2f,%.2f]%s  }",
							cr_lf, cr_lf,
							mpuStatus, cr_lf,
							mpu_data.TEMP, cr_lf,
							mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL, cr_lf,
							mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO, cr_lf);
#endif
		sprintf(tmp+strlen(tmp), "%s}>", cr_lf);
	}
	break;

	default : {// textMode

		sprintf(tmp, " | ms=%lu fifo:%u/%u", tik, cnt_evt, max_evt);
		if (devError) sprintf(tmp+strlen(tmp), " devError:0x%02X", devError);
		sprintf(tmp+strlen(tmp), " | Vcc=%.3f", VccF);
#ifdef SET_BMx280
		sprintf(tmp+strlen(tmp)," | %s: pres=%.2f temp=%.2f",
								bmxName, sensors.bmx_pres, sensors.bmx_temp);
		if (reg_id == BME280_SENSOR) sprintf(tmp+strlen(tmp), " humi=%.2f", sensors.bmx_humi);
#endif
		//compas_stat_t *cStat = (compas_stat_t *)confRegHmc;
		sprintf(tmp+strlen(tmp)," | QMC5883L: azimut=%.2f temp2=%.2f",
			    			compData.angleHMC,
							compData.tempHMC);
#ifdef SET_MPU
		sprintf(tmp+strlen(tmp)," | MPU6050: stat=%X temp3=%.2f accel=%.2f,%.2f,%.2f gyro=%.2f,%.2f,%.2f",
							mpuStatus,
							mpu_data.TEMP,
							mpu_data.xACCEL, mpu_data.yACCEL, mpu_data.zACCEL,
							mpu_data.xGYRO, mpu_data.yGYRO, mpu_data.zGYRO);
#endif

